erickfunier/STM32_Display_TFT/Projeto TFT_2/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#include "string.h"
#include "stdio.h"
#include "stdbool.h"
#include "font.h"
#include "draw_char.h"
#include <math.h>
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
// Definicao de cores para o Display
#define BLACK   0x0000
#define BLUE    0x001F
#define RED     0xF800
#define GREEN   0x07E0
#define CYAN    0x07FF
#define MAGENTA 0xF81F
#define YELLOW  0xFFE0
#define WHITE   0xFFFF
#define _WIDTH 240;
#define _HEIGHT 320;

// Variaveis utilizadas para exibicao do display
#define TFTLCD_DELAY 0xFFFF
#define TFTLCD_DELAY8 0x7F
#define MIPI_DCS_REV1   (1<<0)
#define AUTO_READINC    (1<<1)
#define READ_BGR        (1<<2)
#define READ_LOWHIGH    (1<<3)
#define READ_24BITS     (1<<4)
#define XSA_XEA_16BIT   (1<<5)
#define READ_NODUMMY    (1<<6)
#define INVERT_GS       (1<<8)
#define INVERT_SS       (1<<9)
#define MV_AXIS         (1<<10)
#define INVERT_RGB      (1<<11)
#define REV_SCREEN      (1<<12)
#define FLIP_VERT       (1<<13)
#define FLIP_HORIZ      (1<<14)
#define _swap_int16_t(a, b) { int16_t t = a; a = b; b = t; }
uint16_t _lcd_ID, _lcd_rev, _lcd_madctl, _lcd_drivOut, _MC = 0x4E, _MP = 0x4F, _MW = 0x22, _SC = 0x44, _EC = 0x44, _SP = 0x45, _EP = 0x46, _lcd_capable, _lcd_xor;
uint8_t rotation, textsize;
uint16_t aux1, aux2;
uint16_t WIDTH = 240, HEIGHT = 320;
int16_t cursor_x, cursor_y, _width, _height;
uint16_t textcolor, textbgcolor;
int s1 = 1;
bool wrap, _cp437;
static uint8_t done_reset;

// Declaracao dos Pinos e GPIOs utilizadas
#define CS_PORT	GPIOA
#define CS_PIN	GPIO_PIN_3
#define RS_PORT GPIOA
#define RS_PIN GPIO_PIN_2
#define WR_PORT GPIOA
#define WR_PIN GPIO_PIN_1
#define RD_PORT GPIOA
#define RD_PIN GPIO_PIN_0
#define RST_PORT GPIOA
#define RST_PIN GPIO_PIN_4

#define LCD_D0_PORT GPIOB
#define LCD_D0_PIN GPIO_PIN_8
#define LCD_D1_PORT GPIOB
#define LCD_D1_PIN GPIO_PIN_9
#define LCD_D2_PORT GPIOB
#define LCD_D2_PIN GPIO_PIN_15
#define LCD_D3_PORT GPIOB
#define LCD_D3_PIN GPIO_PIN_14
#define LCD_D4_PORT GPIOB
#define LCD_D4_PIN GPIO_PIN_13
#define LCD_D5_PORT GPIOB
#define LCD_D5_PIN GPIO_PIN_12
#define LCD_D6_PORT GPIOB
#define LCD_D6_PIN GPIO_PIN_11
#define LCD_D7_PORT GPIOB
#define LCD_D7_PIN GPIO_PIN_10

#define PI 3.14159265

uint32_t ADC_BUF[2];
int touchx_atual = 0;
int touchy_atual = 0;
int flag_adc = 1;
int teste = 0;
int eixo_y_plus = 0;
int eixo_y_minus = 20;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
void begin(uint16_t ID);
void invertDisplay(bool i);
void init_table16(const uint16_t table[], int16_t size);
void fillScreen(uint16_t color);
void testDrawScreen();
void setRotation(uint8_t r);
void vertScroll (int16_t top, int16_t scrollines, int16_t offset);
void writeCmdData(uint16_t cmd, uint16_t dat);
void setAddrWindow(int16_t x, int16_t y, int16_t x1, int16_t y1);
void cs_active();
void cs_idle();
void rs_cmd();
void rs_data();
void wr_active();
void wr_idle();
void wr_strobe();
void rd_idle();
void reset_idle();
void reset_active();
void write8(uint8_t x);
void write16(uint16_t x);
void write_8(uint8_t x);
void writeCmd (uint16_t cmd);
void writeData(uint16_t data);
void reset();
void setCursor(int16_t x, int16_t y);
void setTextColor(uint16_t color, uint16_t txtbgcolor);
void setTextSize(uint8_t s);
void print(char c[]);
void write(uint8_t c);
void drawRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color);
void drawPixel(int16_t x, int16_t y, uint16_t color);
void drawHLine(int16_t x, int16_t y, int16_t w, uint16_t color);
void drawVLine(int16_t x, int16_t y, int16_t h, uint16_t color);
void readTouch();
void wr_output();
void wr_analog_input();
void readTouchX();
void readTouchY();
void rs_analog_input();
void rs_output();
void drawChar(uint16_t WIDTH, uint16_t HEIGHT, int16_t x, int16_t y, unsigned char c, uint16_t color, uint16_t bg_color, uint8_t size);
void fillRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color);

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
uint32_t val_adc1; // valor lido no conv ADC
uint32_t val_adc2; // valor lido no conv ADC
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc)	{
	if(hadc->Instance == ADC1)	{
		val_adc1 = ADC_BUF[0];
		val_adc2 = ADC_BUF[1];
		flag_adc = 0;
	}
}

